# running in encoder_proj_cover/src/
read -formal encoder_proj_formal.v
prep -top encoder_proj_formal

hierarchy -smtcheck
rename -witness
write_jny -no-connections ../model/design.json
write_rtlil ../model/design.il
